# Useful APIs of pandas

@author glin

In [6]:
import pandas as pd
import numpy as np

In [ ]:
# mapping between sql and pandas
# https://pandas.pydata.org/pandas-docs/stable/getting_started/comparison/comparison_with_sql.html
# https://medium.com/jbennetcodes/how-to-rewrite-your-sql-queries-in-pandas-and-more-149d341fc53e

In [107]:
# create dataframe
df = pd.DataFrame([['1','2',np.NaN], ['3', '4','6'], [np.NaN, '5',np.NaN], ['1', 9,'3']], columns = ['a','b','c'])
df

     a  b    c
0    1  2  NaN
1    3  4    6
2  NaN  5  NaN
3    1  9    3

In [566]:
# group by a and count number of rows of all columns except 'a' 
# even if they are duplicate
# only for non-NaN 
df.groupby('a').count()

   b  c
a
1  2  1
3  1  1

In [567]:
# group by a and count number of rows for 'a' 
# even if they are duplicate
# NaN not counted (same as sql)
df.groupby('a').size()

a
1    2
3    1
dtype: int64

In [110]:
# group by a and count number of rows for 'a'
# NaN not counted (same as sql)
df.a.value_counts()

1    2
3    1
Name: a, dtype: int64

In [109]:
# group by a and count number of rows for 'a'
# NaN not counted (same as sql)
# show percentage
df.a.value_counts(normalize = True)

1    0.666667
3    0.333333
Name: a, dtype: float64

In [600]:
# count distinct a, NaN not counted (same as sql)
# value_counts() can only be used by series
df.a.value_counts().count()

2

In [ ]:
# count distinct a, NaN not counted (same as sql)
df.groupby('a').size().count()

In [ ]:
# how many records are unique based on key(s)
# groupby, then size, then count can work on more than one key
df.groupby(['a', 'c']).size().count()

In [ ]:
# count distinct a, NaN counted
len(df.a.unique())

In [548]:
# groupby, value_counts etc. automatically sorts values in ascending order
# when I want the last severl items of descending order, I can simply use .tail()
df.a.value_counts().tail()

1    2
3    1
Name: a, dtype: int64

###############

In [ ]:
# convert series to dataframe
s = pd.Series(['1', '2'])
s

In [ ]:
# count(), sum() are both regarding dataframe, series, or DataFrameGroupBy
s.count()

In [ ]:
df1 = pd.DataFrame(s, columns = ['a'])
df1

In [ ]:
df1 = s.to_frame('a')
df1

In [ ]:
# convert string to float
df1.a = df1.a.astype(float)

In [ ]:
# check type
type(df1.a)

In [ ]:
df1.a.dtype

In [573]:
# convert string with $ to float
dollarizer = lambda x: float(x[1:-1])
df = pd.DataFrame([['@1.2','2'], ['$3.1', '4']], columns = ['a','b'])
df = df.a.apply(dollarizer)
df

0    1.0
1    3.0
Name: a, dtype: float64

In [585]:
s = pd.Series(['@1.2', '$3.1'])
# have to work with series, not directly on string, because it needs dtype('O')
[float(x[1:-1]) for x in s]

[1.0, 3.0]

In [ ]:
# groupby a column and then sum, this will sum the rows of all columns
# if the values are string, the sum will concat string
df.groupby('a').sum()

In [ ]:
# sum() does not like different data types, it does not return that column if different types exist in that column

In [ ]:
# sort
df.sort_values(['b'], ascending=False)

In [ ]:
# groupby sorts in asc order automatically
df.groupby(['c','a']).count()

In [ ]:
# the above equals to this
df.groupby(['c','a']).count().sort_values(['c', 'a'], ascending=[True, True])

In [ ]:
df.groupby(['c','a']).size()

In [ ]:
# after groupby on multiple columns, reset_index() adds the index that are empty
df.groupby(['c','a']).size().reset_index()

In [ ]:
df.groupby(['c','a']).size().to_frame('size').reset_index()

In [ ]:
df.groupby(['c','a']).size().to_frame('size').reset_index().sort_values(['c', 'size'], ascending=[True, True])

 
 
##############

In [369]:
# create dataframe
df = pd.DataFrame([['1','2',np.NaN], ['3', '4','6'], [np.NaN, '5',np.NaN], ['1', 9,'3']], columns = ['a','b','c'])
df

     a  b    c
0    1  2  NaN
1    3  4    6
2  NaN  5  NaN
3    1  9    3

In [ ]:
# select where condition
# filter by value
df[df['b'] == '2']

In [ ]:
df[[True, False, False, False]]

In [ ]:
# use in clause
df[df['b'].isin(['2','5'])]

In [ ]:
# use not in clause
df[~df['b'].isin(['2','5'])]

In [ ]:
df['b'].isin(['2','5'])

In [ ]:
df['a']=='1'

In [ ]:
df['b'].isin(['2','5']) & df['a']=='1'

In [ ]:
# Have to use () when using &
(df['b'].isin(['2','5'])) & (df['a']=='1')

In [ ]:
# sort
df.b.sort_values(ascending=False)

In [ ]:
# sum specific columns
df.groupby('a')['b'].sum(axis = 1, skipna = True)

In [ ]:
df.groupby('a')['b'].sum()

In [370]:
# is null
df[df['b'].isna()]

Empty DataFrame
Columns: [a, b, c]
Index: []

In [371]:
# not null
df[df['b'].notna()]

     a  b    c
0    1  2  NaN
1    3  4    6
2  NaN  5  NaN
3    1  9    3

##############

In [ ]:
# create dataframe
df = pd.DataFrame([['1','2','6'], ['3', '4','6'], [np.NaN, '5',np.NaN], ['1', '9','3']], columns = ['a','b','c'])
df

In [ ]:
df.groupby(['c','a']).size().to_frame('size').reset_index()

In [ ]:
df.groupby(['c','a']).size().to_frame('size').reset_index()

In [ ]:
# group by a having count(*) > 1
df.groupby('a').filter(lambda g: len(g) > 1).groupby('a')#.size()#.sort_values(ascending=False)

In [ ]:
# select count(*) from df group by a having count(*) > 0 order by count(*)
df.groupby('a').filter(lambda g: len(g) > 0).groupby('a').size().sort_values(ascending=False)

###########

In [254]:
# create dataframe
df = pd.DataFrame([['1','2','6'], ['3', '4','6'], [np.NaN, '5',np.NaN], ['1', '9','3']], columns = ['a','b','c'])
df = df.astype(float)
df

     a    b    c
0  1.0  2.0  6.0
1  3.0  4.0  6.0
2  NaN  5.0  NaN
3  1.0  9.0  3.0

In [255]:
# agg
df.agg({'b': ['min', 'max', 'mean', 'median']})

          b
min     2.0
max     9.0
mean    5.0
median  4.5

In [256]:
df.agg({'b': ['min', 'max', 'mean', 'median']}).T

   min  max  mean  median
b  2.0  9.0   5.0     4.5

In [257]:
df.b.agg(['min', 'max', 'mean', 'median'])

min       2.0
max       9.0
mean      5.0
median    4.5
Name: b, dtype: float64

In [258]:
df1 = df

In [261]:
# union in sql
pd.concat([df[df.b == 2][['a', 'b']], df1[df1.b == 5][['a', 'b']]])

     a    b
0  1.0  2.0
2  NaN  5.0

In [ ]:
pd.concat([df['a'],df1['a']])

In [ ]:
df2 = pd.concat([df,df1])
df2.reset_index(drop=True)

In [ ]:
# update
# df.loc[row, column] = value
df2.loc[df2['c'] == 3.0, 'b'] = 10

In [ ]:
# all rows
df2['b'] = 10

In [ ]:
# delete rows
# drop a part of dataframe that match a condition
df2.drop(df2[df2.c == 3].index).reset_index()

In [ ]:
# add a column
df2['d'] = 8

In [ ]:
# delete columns
df2.drop('d', axis=1, inplace=True)

In [ ]:
df2

In [ ]:
df2.agg({'a':['mean']})

In [511]:
# axis = 0, operate along x axis (vertical), meaning along all rows for any single column
df2.mean(axis=0)

a    1.666667
b    5.000000
c    5.000000
dtype: float64

In [515]:
# axis = 0, operate along x axis (vertical), meaning along all rows for any single column
df['a'].mean(axis=0)

1.6666666666666667

In [ ]:
# axis = 0, operate along x axis (vertical), meaning along all rows for any single column
df2.loc[:,'a'].mean(axis=0)

In [ ]:
# axis = 1, operate along y axis (horizontal), meaning along all columns for any single row
df2.loc[1, :].mean(axis=1)

In [512]:
# axis = 1, operate along y axis (horizontal), meaning along all columns for any single row
df2.mean(axis=1)

0    3.000000
1    4.333333
2    5.000000
3    4.333333
0    3.000000
1    4.333333
2    5.000000
3    4.333333
dtype: float64

######################

In [15]:
# create dataframe
df = pd.DataFrame([['1','2','6'], ['3', '4','6'], [np.NaN, '5',np.NaN], ['1', '9','6']], columns = ['a','b','c'])
df

     a  b    c
0    1  2    6
1    3  4    6
2  NaN  5  NaN
3    1  9    6

In [383]:
# random sample
df.sample(n=2)

   a  b  c
1  3  4  6
0  1  2  6

In [388]:
df.sample(frac=0.5)

     a  b    c
0    1  2    6
2  NaN  5  NaN

In [486]:
# sample with weights
weights = [0.1, 0.1, 0.1, 0.7]

In [502]:
df.sample(n = 2, weights = weights)

     a  b    c
3    1  9    3
2  NaN  5  NaN

In [508]:
# drop duplicates
df.drop_duplicates('c')

     a  b    c
0    1  2    6
2  NaN  5  NaN

In [509]:
# drop duplicates based on a tuple of columns
df.drop_duplicates(['c','a'])

     a  b    c
0    1  2    6
1    3  4    6
2  NaN  5  NaN

In [17]:
df

     b    c
a
1    2    6
3    4    6
NaN  5  NaN
1    9    6

In [9]:
# use a column as index
df.set_index('a')

KeyError: 'a'

In [16]:
# use a column as index
df.set_index('a', inplace=True)

In [533]:
# reset index to drop the role of the column used as index
df.reset_index()

     a  b    c
0    1  2    6
1    3  4    6
2  NaN  5  NaN
3    1  9    6

In [541]:
# reset index to drop the role of the column used as index
# remember to re-assign!
df = df.reset_index()

######################

In [534]:
# check data type of all columns
df.dtypes

b    object
c    object
dtype: object

In [544]:
# describe, By default, only the numeric columns are returned.
df.a.describe()

count     3
unique    2
top       1
freq      2
Name: a, dtype: object

In [543]:
df.describe()

        a  b  c
count   3  4  3
unique  2  4  1
top     1  5  6
freq    2  1  3

In [545]:
# include all columns
df.describe(include = 'all')

        a  b  c
count   3  4  3
unique  2  4  1
top     1  5  6
freq    2  1  3

#########################

In [604]:
# create dataframe
df = pd.DataFrame([['1','2','4'], ['3', '4','6'], [np.NaN, '5',np.NaN], ['1', '9','3']], columns = ['a','b','c'])
df = df.astype(float)
df

     a    b    c
0  1.0  2.0  4.0
1  3.0  4.0  6.0
2  NaN  5.0  NaN
3  1.0  9.0  3.0

In [549]:
# check position of a column
df.columns.get_loc('b')

1

In [553]:
df.iloc[0,1]

'2'

In [556]:
df.iloc[[1,2]]

     a    b    c
1  3.0  4.0  6.0
2  NaN  5.0  NaN

In [558]:
df.iloc[[1,0],[2,2]]

     a    b    c
1  3.0  4.0  6.0
0  1.0  2.0  6.0

In [560]:
# series iloc
df.a.iloc[1]

3.0

In [570]:
df

     a  b    c
0    1  2  NaN
1    3  4    6
2  NaN  5  NaN
3    1  9    3

In [571]:
df.drop_duplicates('a')

     a  b    c
0    1  2  NaN
1    3  4    6
2  NaN  5  NaN

In [603]:
df

     a    b    c
0  1.0  2.0  3.0
1  3.0  4.0  6.0
2  NaN  5.0  NaN
3  1.0  9.0  3.0

In [605]:
# max() after groupby selects the max of each column => each row in the result is an interleaved result
# the row is no longer the original row 
df.groupby('a').max()

       b    c
a
1.0  9.0  4.0
3.0  4.0  6.0

######################

In [36]:
# create dataframe
df = pd.DataFrame([['1','2','4'], ['3', '4','6'], [np.NaN, '5',np.NaN], ['1', '9','3']], columns = ['a','b','c'])
df = df.astype(float)
df

     a    b    c
0  1.0  2.0  4.0
1  3.0  4.0  6.0
2  NaN  5.0  NaN
3  1.0  9.0  3.0

In [607]:
# except the last column
df.iloc[:, :-1]

     a    b
0  1.0  2.0
1  3.0  4.0
2  NaN  5.0
3  1.0  9.0

In [608]:
df.iloc[:-1, :]

     a    b    c
0  1.0  2.0  4.0
1  3.0  4.0  6.0
2  NaN  5.0  NaN

In [24]:
df

     b    c
a
1    2    6
3    4    6
NaN  5  NaN
1    9    6

In [ ]:
df.set_index('a')

In [28]:
df.loc['3','b']

'4'

In [29]:
df.loc[['3'],['b']]

   b
a
3  4

In [32]:
df.iloc[1,1]

'6'

In [33]:
df.iloc[[1],[1]]

   c
a
3  6

In [38]:
df.count()

a    3
b    4
c    3
dtype: int64

In [49]:
df

     a    b    c
0  1.0  2.0  4.0
1  3.0  4.0  6.0
2  NaN  5.0  NaN
3  1.0  9.0  3.0

#########################

In [50]:
# operate between two dataframes

In [70]:
# create dataframe
df1 = pd.DataFrame([['1','2','4'], ['3', '4','6'], [np.NaN, '5',np.NaN], ['1', '9','3']], columns = ['a','b','c'])
df1 = df1.astype(float)
df1

     a    b    c
0  1.0  2.0  4.0
1  3.0  4.0  6.0
2  NaN  5.0  NaN
3  1.0  9.0  3.0

In [82]:
df2 = pd.DataFrame([['1','2','4'], ['3', '4','6']], columns = ['a','b','c'])
df2 = df2.astype(float)
df2

     a    b    c
0  1.0  2.0  4.0
1  3.0  4.0  6.0

In [86]:
# fill_value means the value you assign if it does not exist
df1.div(df2, level=1, fill_value=2)

     a    b    c
0  1.0  1.0  1.0
1  1.0  1.0  1.0
2  NaN  2.5  NaN
3  0.5  4.5  1.5

In [61]:
df2.div(df1)

          b         c
a   b
1.0 2.0 NaN  1.750000
    9.0 NaN  2.333333
3.0 4.0 NaN  1.000000

In [62]:
df1/df2

          b         c
a   b
1.0 2.0 NaN  0.571429
    9.0 NaN  0.428571
3.0 4.0 NaN  1.000000

In [98]:
def test_var_args_call(arg1, arg2, anything):
    print("arg1:" + arg1)
    print("arg2:" + arg2)
    print("arg3:" + anything)

In [101]:
kwargs = {'3', "two"}
test_var_args_call('1', *kwargs)

arg1:1
arg2:3
arg3:two

In [103]:
kwargs = ['3', "two"]
test_var_args_call('1', *kwargs)

arg1:1
arg2:3
arg3:two

In [106]:
# when using key-worded (key-value pair), use **
kwargs = {'anything':'3', 'arg2':"two"}
test_var_args_call('1', **kwargs)

arg1:1
arg2:two
arg3:3

##########################

In [111]:
# Iterate groupby
# create dataframe
df = pd.DataFrame([['1','2','4'], ['3', '4','6'], [np.NaN, '5',np.NaN], ['1', '9','3']], columns = ['a','b','c'])
df = df.astype(float)
df

     a    b    c
0  1.0  2.0  4.0
1  3.0  4.0  6.0
2  NaN  5.0  NaN
3  1.0  9.0  3.0

In [122]:
for x in df.groupby('a'):
    print('haha')
    print(x)

haha
(1.0,      a    b    c
0  1.0  2.0  4.0
3  1.0  9.0  3.0)
haha
(3.0,      a    b    c
1  3.0  4.0  6.0)

######################

In [219]:
# lambda, map
df = pd.DataFrame([['fd','ds','dfsa'], ['safd', 'werq','xvda']], columns = ['a','b','c'])
df

      a     b     c
0    fd    ds  dfsa
1  safd  werq  xvda

In [220]:
df.a.str.upper()

0      FD
1    SAFD
Name: a, dtype: object

In [221]:
# dataframe dot apply operates on each column
df.apply(lambda x: x.max())

a    safd
b    werq
c    xvda
dtype: object

In [172]:
# dataframe dot applymap operates on each element
df.applymap(lambda x: x.upper())

      a     b     c
0    FD    DS  DFSA
1  SAFD  WERQ  XVDA

In [222]:
def to_upper(x):
    return x.upper()

In [223]:
df.applymap(lambda x: to_upper(x))

      a     b     c
0    FD    DS  DFSA
1  SAFD  WERQ  XVDA

In [174]:
# series dot map operates on each element
df.a.map(lambda x: x.upper())

0      FD
1    SAFD
Name: a, dtype: object

In [175]:
# series dot apply operates on each element
df.a.apply(lambda x: x.upper())

0      FD
1    SAFD
Name: a, dtype: object

In [176]:
# difference between apply, applymap, map
# https://stackoverflow.com/questions/19798153/difference-between-map-applymap-and-apply-methods-in-pandas

#########

In [177]:
# datetime

In [198]:
df = pd.DataFrame({'a':['06/08/201923lin15:02'], 'b':['2019-02-04']}, columns = ['a', 'b'])
df

                      a           b
0  06/08/201923lin15:02  2019-02-04

In [199]:
df.a = pd.to_datetime(df.a, format = '%d/%m/%Y%Hlin%M:%S')

In [200]:
type(df.a.iloc[0])

pandas._libs.tslibs.timestamps.Timestamp

In [201]:
df.a.iloc[0].day

6

In [202]:
pd.Timestamp.now()

Timestamp('2019-08-06 19:57:45.801600')

In [203]:
pd.Timestamp.now().day

6

In [204]:
pd.Timestamp.now().month

8

In [205]:
dir(pd.Timestamp.now())

['__add__',
 '__class__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__le__',
 '__lt__',
 '__module__',
 '__ne__',
 '__new__',
 '__pyx_vtable__',
 '__radd__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rsub__',
 '__setattr__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__weakref__',
 '_date_attributes',
 '_date_repr',
 '_get_date_name_field',
 '_get_start_end_field',
 '_has_time_component',
 '_repr_base',
 '_round',
 '_short_repr',
 '_time_repr',
 'asm8',
 'astimezone',
 'ceil',
 'combine',
 'ctime',
 'date',
 'day',
 'day_name',
 'dayofweek',
 'dayofyear',
 'days_in_month',
 'daysinmonth',
 'dst',
 'floor',
 'fold',
 'freq',
 'freqstr',
 'fromisoformat',
 'fromordinal',
 'fromtimestamp',
 'hour',
 'is_leap_year',
 'is_month_end',
 'is_month_start',
 'is_quarter_end',
 'is_quarter_start',
 'is_year_end',
 'is_year_start',
 'isocalendar',
 'isoformat',
 'isoweekday',
 'max',
 'microsecond',
 'min',
 'minute',
 'month',
 'month_name',
 'nanosecond',
 'normalize',
 'now',
 'quarter',
 'replace',
 'resolution',
 'round',
 'second',
 'strftime',
 'strptime',
 'time',
 'timestamp',
 'timetuple',
 'timetz',
 'to_datetime64',
 'to_julian_date',
 'to_period',
 'to_pydatetime',
 'today',
 'toordinal',
 'tz',
 'tz_convert',
 'tz_localize',
 'tzinfo',
 'tzname',
 'utcfromtimestamp',
 'utcnow',
 'utcoffset',
 'utctimetuple',
 'value',
 'week',
 'weekday',
 'weekday_name',
 'weekofyear',
 'year']

In [206]:
type(pd.Timestamp.now())

pandas._libs.tslibs.timestamps.Timestamp

In [207]:
pd.Timestamp.now().day_name()

'Tuesday'

In [208]:
"%a:%a" % (df.a.iloc[0].hour, df.a.iloc[0].minute)

'23:15'

In [209]:
"%a %a" % (df.a.iloc[0].year, df.a.iloc[0].minute)

'2019 15'

In [210]:
df.a.iloc[0].time()

datetime.time(23, 15, 2)

In [211]:
str(df.a.iloc[0].time())

'23:15:02'

In [212]:
str(df.a.iloc[0].time())[0:5]

'23:15'

In [216]:
df.a.iloc[0].strftime('%Y blabla %d')

'2019 blabla 06'

In [217]:
pd.DatetimeIndex(['2018-02-04', '2019-02-04']).year

Int64Index([2018, 2019], dtype='int64')

In [215]:
pd.DatetimeIndex(['2018-02-04', '2019-02-04']).day

Int64Index([4, 4], dtype='int64')

In [218]:
df.a.apply(lambda x: x.strftime('%Y blabla %d'))

0    2019 blabla 06
Name: a, dtype: object

####################

In [229]:
# resample
rng = pd.date_range('1/1/2012', periods=100, freq='S')
rng

DatetimeIndex(['2012-01-01 00:00:00', '2012-01-01 00:00:01',
               '2012-01-01 00:00:02', '2012-01-01 00:00:03',
               '2012-01-01 00:00:04', '2012-01-01 00:00:05',
               '2012-01-01 00:00:06', '2012-01-01 00:00:07',
               '2012-01-01 00:00:08', '2012-01-01 00:00:09',
               '2012-01-01 00:00:10', '2012-01-01 00:00:11',
               '2012-01-01 00:00:12', '2012-01-01 00:00:13',
               '2012-01-01 00:00:14', '2012-01-01 00:00:15',
               '2012-01-01 00:00:16', '2012-01-01 00:00:17',
               '2012-01-01 00:00:18', '2012-01-01 00:00:19',
               '2012-01-01 00:00:20', '2012-01-01 00:00:21',
               '2012-01-01 00:00:22', '2012-01-01 00:00:23',
               '2012-01-01 00:00:24', '2012-01-01 00:00:25',
               '2012-01-01 00:00:26', '2012-01-01 00:00:27',
               '2012-01-01 00:00:28', '2012-01-01 00:00:29',
               '2012-01-01 00:00:30', '2012-01-01 00:00:31',
               '2012-01-01 00:00:32', '2012-01-01 00:00:33',
               '2012-01-01 00:00:34', '2012-01-01 00:00:35',
               '2012-01-01 00:00:36', '2012-01-01 00:00:37',
               '2012-01-01 00:00:38', '2012-01-01 00:00:39',
               '2012-01-01 00:00:40', '2012-01-01 00:00:41',
               '2012-01-01 00:00:42', '2012-01-01 00:00:43',
               '2012-01-01 00:00:44', '2012-01-01 00:00:45',
               '2012-01-01 00:00:46', '2012-01-01 00:00:47',
               '2012-01-01 00:00:48', '2012-01-01 00:00:49',
               '2012-01-01 00:00:50', '2012-01-01 00:00:51',
               '2012-01-01 00:00:52', '2012-01-01 00:00:53',
               '2012-01-01 00:00:54', '2012-01-01 00:00:55',
               '2012-01-01 00:00:56', '2012-01-01 00:00:57',
               '2012-01-01 00:00:58', '2012-01-01 00:00:59',
               '2012-01-01 00:01:00', '2012-01-01 00:01:01',
               '2012-01-01 00:01:02', '2012-01-01 00:01:03',
               '2012-01-01 00:01:04', '2012-01-01 00:01:05',
               '2012-01-01 00:01:06', '2012-01-01 00:01:07',
               '2012-01-01 00:01:08', '2012-01-01 00:01:09',
               '2012-01-01 00:01:10', '2012-01-01 00:01:11',
               '2012-01-01 00:01:12', '2012-01-01 00:01:13',
               '2012-01-01 00:01:14', '2012-01-01 00:01:15',
               '2012-01-01 00:01:16', '2012-01-01 00:01:17',
               '2012-01-01 00:01:18', '2012-01-01 00:01:19',
               '2012-01-01 00:01:20', '2012-01-01 00:01:21',
               '2012-01-01 00:01:22', '2012-01-01 00:01:23',
               '2012-01-01 00:01:24', '2012-01-01 00:01:25',
               '2012-01-01 00:01:26', '2012-01-01 00:01:27',
               '2012-01-01 00:01:28', '2012-01-01 00:01:29',
               '2012-01-01 00:01:30', '2012-01-01 00:01:31',
               '2012-01-01 00:01:32', '2012-01-01 00:01:33',
               '2012-01-01 00:01:34', '2012-01-01 00:01:35',
               '2012-01-01 00:01:36', '2012-01-01 00:01:37',
               '2012-01-01 00:01:38', '2012-01-01 00:01:39'],
              dtype='datetime64[ns]', freq='S')

In [231]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts

2012-01-01 00:00:00    418
2012-01-01 00:00:01    296
2012-01-01 00:00:02    377
2012-01-01 00:00:03    228
2012-01-01 00:00:04    379
2012-01-01 00:00:05    275
2012-01-01 00:00:06    454
2012-01-01 00:00:07    247
2012-01-01 00:00:08    114
2012-01-01 00:00:09    428
2012-01-01 00:00:10     95
2012-01-01 00:00:11    491
2012-01-01 00:00:12    175
2012-01-01 00:00:13    157
2012-01-01 00:00:14    446
2012-01-01 00:00:15    240
2012-01-01 00:00:16    400
2012-01-01 00:00:17     48
2012-01-01 00:00:18    309
2012-01-01 00:00:19    404
2012-01-01 00:00:20    130
2012-01-01 00:00:21      7
2012-01-01 00:00:22     20
2012-01-01 00:00:23     46
2012-01-01 00:00:24     23
2012-01-01 00:00:25     90
2012-01-01 00:00:26    308
2012-01-01 00:00:27    491
2012-01-01 00:00:28     16
2012-01-01 00:00:29     51
                      ...
2012-01-01 00:01:10    479
2012-01-01 00:01:11    248
2012-01-01 00:01:12    465
2012-01-01 00:01:13    222
2012-01-01 00:01:14    163
2012-01-01 00:01:15    249
2012-01-01 00:01:16     73
2012-01-01 00:01:17    484
2012-01-01 00:01:18    282
2012-01-01 00:01:19    357
2012-01-01 00:01:20    457
2012-01-01 00:01:21    488
2012-01-01 00:01:22    208
2012-01-01 00:01:23    429
2012-01-01 00:01:24    142
2012-01-01 00:01:25    294
2012-01-01 00:01:26    270
2012-01-01 00:01:27     51
2012-01-01 00:01:28    150
2012-01-01 00:01:29     20
2012-01-01 00:01:30    465
2012-01-01 00:01:31    179
2012-01-01 00:01:32    370
2012-01-01 00:01:33    331
2012-01-01 00:01:34    436
2012-01-01 00:01:35    197
2012-01-01 00:01:36    484
2012-01-01 00:01:37      5
2012-01-01 00:01:38    467
2012-01-01 00:01:39    246
Freq: S, Length: 100, dtype: int64

In [243]:
ts.resample('1T').sum()

2012-01-01 00:00:00    16087
2012-01-01 00:01:00    11880
Freq: T, dtype: int64

In [244]:
# see all the offset alias
# https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#resampling

####################

In [245]:
# Iterate groupby
# create dataframe
df = pd.DataFrame([['1','2','4'], ['3', '4','6'], [np.NaN, '5',np.NaN], ['1', '9','3']], columns = ['a','b','c'])
df = df.astype(float)
df

     a    b    c
0  1.0  2.0  4.0
1  3.0  4.0  6.0
2  NaN  5.0  NaN
3  1.0  9.0  3.0

In [249]:
df.idxmax(0)

a    1
b    3
c    1
dtype: int64

In [248]:
df.idxmax(1)

0    c
1    c
2    b
3    b
dtype: object

##############

In [250]:
# random numbers
np.random.randint(15, high=20, size=3, dtype='l')

array([19, 18, 15])

In [253]:
# rename columns
df.rename(columns = {'a': 'A', 'b': 'B', 'c': 'C'}, inplace=True)
df

     A    B    C
0  1.0  2.0  4.0
1  3.0  4.0  6.0
2  NaN  5.0  NaN
3  1.0  9.0  3.0

###################

In [263]:
# sum() can count the number of True
df = pd.DataFrame([['1','2','4'], ['3', '4','6'], [np.NaN, '5',np.NaN], ['1', '9','3']], columns = ['a','b','c'])
df = df.astype(float)
df

     a    b    c
0  1.0  2.0  4.0
1  3.0  4.0  6.0
2  NaN  5.0  NaN
3  1.0  9.0  3.0

In [270]:
df.isnull().sum()

a    1
b    0
c    1
dtype: int64

In [271]:
df.notnull().sum()

a    3
b    4
c    3
dtype: int64

In [268]:
df.a.duplicated().sum()

1

In [274]:
df.values.flatten()

array([ 1.,  2.,  4.,  3.,  4.,  6., nan,  5., nan,  1.,  9.,  3.])

In [279]:
# fill in null value with a value
df = df.fillna(3)
df

     a    b    c
0  1.0  2.0  4.0
1  3.0  4.0  6.0
2  3.0  5.0  3.0
3  1.0  9.0  3.0

In [280]:
df.values.flatten().mean()

3.6666666666666665

In [289]:
df.describe(percentiles=[])

              a        b         c
count  4.000000  4.00000  4.000000
mean   2.000000  5.00000  4.000000
std    1.154701  2.94392  1.414214
min    1.000000  2.00000  3.000000
50%    2.000000  4.50000  3.500000
max    3.000000  9.00000  6.000000

######################

In [291]:
# min(), max(), mean(), std()
df.min()

a    1.0
b    2.0
c    3.0
dtype: float64

In [292]:
df.min(axis = 1)

0    1.0
1    3.0
2    3.0
3    1.0
dtype: float64

###############

In [367]:
# month, day etc. can be accessed directly at index level if index is datetime (TimeStamp) type
df = pd.DataFrame({'a': ['2019-01-05', '2019-03-23'], 'b': ['2019-01-21', '2019-03-09']})
df = df.apply(pd.to_datetime)
df

           a          b
0 2019-01-05 2019-01-21
1 2019-03-23 2019-03-09

In [368]:
# or
df = pd.DataFrame({'a': ['2019-01-05', '2019-03-23'], 'b': ['2019-01-21', '2019-03-09']})
df.a = pd.to_datetime(df.a, format = '%Y-%m-%d')
df.b = pd.to_datetime(df.b, format = '%Y-%m-%d')
df

           a          b
0 2019-01-05 2019-01-21
1 2019-03-23 2019-03-09

In [370]:
type(df.a.iloc[0])

pandas._libs.tslibs.timestamps.Timestamp

In [380]:
df = df.set_index('a')
df

                    b
a
2019-01-05 2019-01-21
2019-03-23 2019-03-09

In [372]:
df.index.month

Int64Index([1, 3], dtype='int64', name='a')

In [373]:
df[df.index.month == 3]

                    b
a
2019-03-23 2019-03-09

####################

In [393]:
df = pd.DataFrame({'a': ['2019-01-05', '2019-03-23'], 'b': [21, 9]})
df.a = df.a.apply(pd.to_datetime)
df

           a   b
0 2019-01-05  21
1 2019-03-23   9

In [394]:
type(df.a.dt)

pandas.core.indexes.accessors.DatetimeProperties

In [395]:
df.a.dt

In [396]:
df.a.dt.to_period('Y')

0    2019
1    2019
Name: a, dtype: period[A-DEC]

In [397]:
type(df.a.dt.to_period('Y'))

pandas.core.series.Series

In [399]:
# downsample to year level
df.groupby(df.a.dt.to_period('Y')).mean()

       b
a
2019  15

In [400]:
# downsample to week level
df.groupby(df.a.dt.to_period('W')).mean()

                        b
a
2018-12-31/2019-01-06  21
2019-03-18/2019-03-24   9

#####################

In [ ]:
# want to use resample on dataframe, then i should set_index()

In [406]:
df = pd.DataFrame({'a': ['2019-01-05', '2019-03-23'], 'b': [21, 9]})
df.a = df.a.apply(pd.to_datetime)
df

           a   b
0 2019-01-05  21
1 2019-03-23   9

In [408]:
df = df.set_index('a')
df

             b
a
2019-01-05  21
2019-03-23   9

In [410]:
# dataframe dot resample
df.resample('W').agg(['min','max','mean','std'])

               b
             min   max  mean std
a
2019-01-06  21.0  21.0  21.0 NaN
2019-01-13   NaN   NaN   NaN NaN
2019-01-20   NaN   NaN   NaN NaN
2019-01-27   NaN   NaN   NaN NaN
2019-02-03   NaN   NaN   NaN NaN
2019-02-10   NaN   NaN   NaN NaN
2019-02-17   NaN   NaN   NaN NaN
2019-02-24   NaN   NaN   NaN NaN
2019-03-03   NaN   NaN   NaN NaN
2019-03-10   NaN   NaN   NaN NaN
2019-03-17   NaN   NaN   NaN NaN
2019-03-24   9.0   9.0   9.0 NaN

#######################

In [411]:
# dataframe from dict
data = {'a': ['2019-01-05', '2019-03-23'], 'b': ['2019-01-21', '2019-03-09']}
type(data)

dict

In [413]:
df = pd.DataFrame(data)
df

            a           b
0  2019-01-05  2019-01-21
1  2019-03-23  2019-03-09